TheThingsIndustries/generic-node-se/Software/target/stm32_adv_trace.c
/**
  ******************************************************************************
  * @file    stm32_adv_trace.c
  * @author  MCD Application Team
  * @brief   This file contains the advanced trace utility functions.
 ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32_adv_trace.h"
#include "stdarg.h"
#include "stdio.h"

/** @addtogroup ADV_TRACE
  * @{
  */

/* Private defines -----------------------------------------------------------*/

/** @defgroup ADV_TRACE_Private_defines ADV_TRACE Privates defines
 *  @{
 */

#if defined(UTIL_ADV_TRACE_OVERRUN)
/**
 *  @brief  List the overrun status.
 *  list of the overrun status used to handle the overrun trace evacuation.
 *
 *  @note only valid if UTIL_ADV_TRACE_OVERRUN has been enabled inside utilities conf
 */
typedef enum {
  TRACE_OVERRUN_NONE = 0,     /*!<overrun status none.                        */
  TRACE_OVERRUN_INDICATION,   /*!<overrun status an indication shall be sent. */
  TRACE_OVERRUN_TRANSFERT,    /*!<overrun status data transfer ongoing.       */
  TRACE_OVERRUN_EXECUTED,     /*!<overrun status data transfer complete.      */
} TRACE_OVERRUN_STATUS;
#endif

#if defined(UTIL_ADV_TRACE_UNCHUNK_MODE)
/**
 *  @brief  List the unchunk status.
 *  list of the unchunk status used to handle the unchunk case.
 *
 *  @note only valid if UTIL_ADV_TRACE_UNCHUNK_MODE has been enabled inside utilities conf
 */
typedef enum {
  TRACE_UNCHUNK_NONE = 0,     /*!<unchunk status none.                            */
  TRACE_UNCHUNK_DETECTED,     /*!<unchunk status an unchunk has been detected.    */
  TRACE_UNCHUNK_TRANSFER      /*!<unchunk status an unchunk transfert is ongoing. */
} TRACE_UNCHUNK_STATUS;
#endif
/**
  * @}
 */

/**
 *  @brief  advanced macro to override to enable debug mode
 */
#ifndef UTIL_ADV_TRACE_DEBUG
#define UTIL_ADV_TRACE_DEBUG(...)
#endif
/* Private macros ------------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/

/** @defgroup ADV_TRACE_private_typedef ADV_TRACE private typedef
 *  @{
 */

/**
 *  @brief  ADV_TRACE_Context.
 *  this structure contains all the data to handle the trace context.
 *
 *  @note some part of the context are depend with the selecte switch inside the configuration file
 *  UTIL_ADV_TRACE_UNCHUNK_MODE, UTIL_ADV_TRACE_OVERRUN, UTIL_ADV_TRACE_CONDITIONNAL
 */
typedef struct {
#if defined(UTIL_ADV_TRACE_UNCHUNK_MODE)
  uint16_t unchunk_enabled;                              /*!<unchunck enable.                           */
  TRACE_UNCHUNK_STATUS unchunk_status;                   /*!<unchunk transfert status.                  */
#endif
#if defined(UTIL_ADV_TRACE_OVERRUN)
  TRACE_OVERRUN_STATUS OverRunStatus;                    /*!<overun status.                             */
  cb_overrun *overrun_func;                               /*!<overun function                            */
#endif
#if defined(UTIL_ADV_TRACE_CONDITIONNAL)
  cb_timestamp *timestamp_func;                           /*!<ptr of function used to insert time stamp. */
  uint8_t CurrentVerboseLevel;                           /*!<verbose level used.                        */
  uint32_t RegionMask;                                   /*!<mask of the enabled region.                */
#endif
  uint16_t TraceRdPtr;                                   /*!<read pointer the trace system.             */
  uint16_t TraceWrPtr;                                   /*!<write pointer the trace system.            */
  uint16_t TraceSentSize;                                /*!<size of the latest transfer.               */
  uint16_t TraceLock;                                    /*!<lock counter of the trace system.          */
  uint8_t TraceBuffer[UTIL_ADV_TRACE_FIFO_SIZE];         /*!<fifo of the trace system.                  */
} ADV_TRACE_Context;

/**
 *  @}
 */

/* Private variables ---------------------------------------------------------*/
/** @defgroup ADV_TRACE_private_variable ADV_TRACE private variable
 * private variable of the advanced trace system.
 *  @{
 */

/**
 * @brief trace context
 * this variable contains all the internal data of the advanced trace system.
 */
static ADV_TRACE_Context ADV_TRACE_Ctx;

/**
 * @}
 */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup ADV_TRACE_private_function ADV_TRACE private function
 *
 *  @{
 */
static void TRACE_TxCpltCallback(void *Ptr);
static int16_t TRACE_AllocateBufer(uint16_t Size, uint16_t *Pos);
static UTIL_ADV_TRACE_Status_t TRACE_Send(void);

static void TRACE_Lock(void);
static void TRACE_UnLock(void);
static uint32_t TRACE_IsLocked(void);

/**
  * @}
  */

/* Functions Definition ------------------------------------------------------*/

/** @addtogroup ADV_TRACE_exported_function
 *  @{
 */
UTIL_ADV_TRACE_Status_t UTIL_ADV_TRACE_Init(void)
{
  /* initialize the Ptr for Read/Write */
  (void)UTIL_ADV_TRACE_MEMSET8(&ADV_TRACE_Ctx, 0x0, sizeof(ADV_TRACE_Context));

#if defined(UTIL_ADV_TRACE_UNCHUNK_MODE)
  UTIL_ADV_TRACE_DEBUG("\nUNCHUNK_MODE\n");
#endif
  /* Allocate Lock resource */
  UTIL_ADV_TRACE_INIT_CRITICAL_SECTION();
  
  /* Initialize the Low Level interface */  
  return UTIL_TraceDriver.Init(TRACE_TxCpltCallback);
}

