TheThingsIndustries/generic-node-se/Software/target/stm32_adv_trace.c
UTIL_ADV_TRACE_Status_t UTIL_ADV_TRACE_DeInit(void)
{
  /* Un-initialize the Low Level interface */
  return UTIL_TraceDriver.DeInit();
}

UTIL_ADV_TRACE_Status_t UTIL_ADV_TRACE_StartRxProcess(void (*UserCallback)(uint8_t *PData, uint16_t Size, uint8_t Error))
{
  /* start the RX process */
  return UTIL_TraceDriver.StartRx(UserCallback);
}

#if defined(UTIL_ADV_TRACE_CONDITIONNAL)
UTIL_ADV_TRACE_Status_t UTIL_ADV_TRACE_COND_FSend(uint32_t VerboseLevel, uint32_t Region, uint32_t TimeStampState, const char *strFormat, ...)
{
  va_list vaArgs;
  uint8_t buf[UTIL_ADV_TRACE_TMP_BUF_SIZE + UTIL_ADV_TRACE_TMP_MAX_TIMESTMAP_SIZE];
  uint16_t buff_size = 0u;

  /* check verbose level */
  if (!( ADV_TRACE_Ctx.CurrentVerboseLevel >= VerboseLevel))
  {
	  return UTIL_ADV_TRACE_GIVEUP;
  }

  if(( Region & ADV_TRACE_Ctx.RegionMask) != Region)
  {
	  return UTIL_ADV_TRACE_REGIONMASKED;
  }

  if((ADV_TRACE_Ctx.timestamp_func != NULL) && (TimeStampState != 0u))
  {
	  ADV_TRACE_Ctx.timestamp_func(buf,&buff_size);
  }

  va_start( vaArgs, strFormat);
  buff_size+=(uint16_t)UTIL_ADV_TRACE_VSNPRINTF((char *)(buf + buff_size), UTIL_ADV_TRACE_TMP_BUF_SIZE, strFormat, vaArgs);
  va_end(vaArgs);

  return UTIL_ADV_TRACE_Send(buf, buff_size);
}
#endif

UTIL_ADV_TRACE_Status_t UTIL_ADV_TRACE_FSend(const char *strFormat, ...)
{
  uint8_t buf[UTIL_ADV_TRACE_TMP_BUF_SIZE];
  va_list vaArgs; 

  va_start( vaArgs, strFormat);
  uint16_t bufSize=(uint16_t)UTIL_ADV_TRACE_VSNPRINTF((char *)buf ,UTIL_ADV_TRACE_TMP_BUF_SIZE, strFormat, vaArgs);
  va_end(vaArgs);
  
  return UTIL_ADV_TRACE_Send(buf, bufSize);
}

#if defined(UTIL_ADV_TRACE_CONDITIONNAL)
UTIL_ADV_TRACE_Status_t UTIL_ADV_TRACE_COND_ZCSend_Allocation(uint32_t VerboseLevel, uint32_t Region, uint32_t TimeStampState, uint16_t length, uint8_t **pData, uint16_t *FifoSize, uint16_t *WritePos)
{
  UTIL_ADV_TRACE_Status_t ret = UTIL_ADV_TRACE_OK;
  uint16_t writepos;
  uint8_t timestamp_ptr[UTIL_ADV_TRACE_TMP_MAX_TIMESTMAP_SIZE];
  uint16_t timestamp_size = 0u;

  /* check verbose level */
  if (!( ADV_TRACE_Ctx.CurrentVerboseLevel >= VerboseLevel))
  {
    return UTIL_ADV_TRACE_GIVEUP;
  }
  
  if(( Region & ADV_TRACE_Ctx.RegionMask) != Region)
  {
	  return UTIL_ADV_TRACE_REGIONMASKED;
  }
  
  if((ADV_TRACE_Ctx.timestamp_func != NULL) && (TimeStampState != 0u))
  {
	  ADV_TRACE_Ctx.timestamp_func(timestamp_ptr,&timestamp_size);
  }

  TRACE_Lock();
  
  /* if allocation is ok, write data into the bufffer */
  if (TRACE_AllocateBufer(length+timestamp_size, &writepos) != -1)
  {
#if defined(UTIL_ADV_TRACE_OVERRUN)
    UTIL_ADV_TRACE_ENTER_CRITICAL_SECTION();
    if(ADV_TRACE_Ctx.OverRunStatus == TRACE_OVERRUN_EXECUTED)
    {
      /* clear the over run */
	    ADV_TRACE_Ctx.OverRunStatus = TRACE_OVERRUN_NONE;
    }
    UTIL_ADV_TRACE_EXIT_CRITICAL_SECTION();
#endif
    
    /* fill time stamp information */
    for(uint16_t index = 0u; index < timestamp_size; index++)
    {
      ADV_TRACE_Ctx.TraceBuffer[writepos] = timestamp_ptr[index];
      writepos = (uint16_t)((writepos + 1u) % UTIL_ADV_TRACE_FIFO_SIZE);
    }
    
    /*user fill */
    *pData = ADV_TRACE_Ctx.TraceBuffer;
    *FifoSize = (uint16_t)UTIL_ADV_TRACE_FIFO_SIZE;
    *WritePos = writepos;
  }
  else
  {
#if defined(UTIL_ADV_TRACE_OVERRUN)
    UTIL_ADV_TRACE_ENTER_CRITICAL_SECTION();
    if((ADV_TRACE_Ctx.OverRunStatus == TRACE_OVERRUN_NONE ) && (NULL != ADV_TRACE_Ctx.overrun_func))
    {
      UTIL_ADV_TRACE_DEBUG(":TRACE_OVERRUN_INDICATION");
      ADV_TRACE_Ctx.OverRunStatus = TRACE_OVERRUN_INDICATION;
    }
    UTIL_ADV_TRACE_EXIT_CRITICAL_SECTION();
#endif
    TRACE_UnLock();
    ret = UTIL_ADV_TRACE_MEM_FULL;
  }
  return ret;
}

UTIL_ADV_TRACE_Status_t UTIL_ADV_TRACE_COND_ZCSend_Finalize(void)
{
	return UTIL_ADV_TRACE_ZCSend_Finalize();
}
#endif

UTIL_ADV_TRACE_Status_t UTIL_ADV_TRACE_ZCSend_Allocation(uint16_t Length, uint8_t **pData, uint16_t *FifoSize, uint16_t *WritePos)
{
  UTIL_ADV_TRACE_Status_t ret = UTIL_ADV_TRACE_OK;
  uint16_t writepos;

  TRACE_Lock();

  /* if allocation is ok, write data into the bufffer */
  if (TRACE_AllocateBufer(Length,&writepos)  != -1)
  {
#if defined(UTIL_ADV_TRACE_OVERRUN)
	UTIL_ADV_TRACE_ENTER_CRITICAL_SECTION();
	if(ADV_TRACE_Ctx.OverRunStatus == TRACE_OVERRUN_EXECUTED)
	{
		/* clear the over run */
	    ADV_TRACE_Ctx.OverRunStatus = TRACE_OVERRUN_NONE;
	}
	UTIL_ADV_TRACE_EXIT_CRITICAL_SECTION();
#endif

	/*user fill */
	*pData = ADV_TRACE_Ctx.TraceBuffer;
	*FifoSize = UTIL_ADV_TRACE_FIFO_SIZE;
	*WritePos = (uint16_t)writepos;
  }
  else
  {
#if defined(UTIL_ADV_TRACE_OVERRUN)
	UTIL_ADV_TRACE_ENTER_CRITICAL_SECTION();
	if((ADV_TRACE_Ctx.OverRunStatus == TRACE_OVERRUN_NONE ) && (NULL != ADV_TRACE_Ctx.overrun_func))
	{
		UTIL_ADV_TRACE_DEBUG("UTIL_ADV_TRACE_ZCSend:TRACE_OVERRUN_INDICATION");
		ADV_TRACE_Ctx.OverRunStatus = TRACE_OVERRUN_INDICATION;
	}
	UTIL_ADV_TRACE_EXIT_CRITICAL_SECTION();
#endif
    TRACE_UnLock();
    ret = UTIL_ADV_TRACE_MEM_FULL;
  }

  return ret;
}

UTIL_ADV_TRACE_Status_t UTIL_ADV_TRACE_ZCSend_Finalize(void)
{
    TRACE_UnLock();
    return TRACE_Send();
}

#if defined(UTIL_ADV_TRACE_CONDITIONNAL)
UTIL_ADV_TRACE_Status_t UTIL_ADV_TRACE_COND_Send(uint32_t VerboseLevel, uint32_t Region, uint32_t TimeStampState, const uint8_t *pData, uint16_t Length)
{
  UTIL_ADV_TRACE_Status_t ret;  
  uint16_t writepos;
  uint32_t  idx;
  uint8_t timestamp_ptr[UTIL_ADV_TRACE_TMP_MAX_TIMESTMAP_SIZE];
  uint16_t timestamp_size = 0u;

  /* check verbose level */
  if (!( ADV_TRACE_Ctx.CurrentVerboseLevel >= VerboseLevel))
  {
	return UTIL_ADV_TRACE_GIVEUP;
  }

  if(( Region & ADV_TRACE_Ctx.RegionMask) != Region)
  {
	  return UTIL_ADV_TRACE_REGIONMASKED;
  }

  if((ADV_TRACE_Ctx.timestamp_func != NULL) && (TimeStampState != 0u))
  {
	  ADV_TRACE_Ctx.timestamp_func(timestamp_ptr,&timestamp_size);
  }

  TRACE_Lock();

  /* if allocation is ok, write data into the bufffer */
  if (TRACE_AllocateBufer(Length + timestamp_size, &writepos) != -1)
  {
#if defined(UTIL_ADV_TRACE_OVERRUN)
    UTIL_ADV_TRACE_ENTER_CRITICAL_SECTION();
    if(ADV_TRACE_Ctx.OverRunStatus == TRACE_OVERRUN_EXECUTED)
    {
      /* clear the over run */
	    ADV_TRACE_Ctx.OverRunStatus = TRACE_OVERRUN_NONE;
    }
    UTIL_ADV_TRACE_EXIT_CRITICAL_SECTION();
#endif
    
    /* fill time stamp information */
    for( idx = 0; idx < timestamp_size; idx++)
    {
      ADV_TRACE_Ctx.TraceBuffer[writepos] = timestamp_ptr[idx];
      writepos = (uint16_t)((writepos + 1u) % UTIL_ADV_TRACE_FIFO_SIZE);
    }
    
    for (idx = 0u; idx < Length; idx++)
    {
      ADV_TRACE_Ctx.TraceBuffer[writepos] = pData[idx];
      writepos = (uint16_t)((writepos + 1u) % UTIL_ADV_TRACE_FIFO_SIZE);
    }

    TRACE_UnLock();
    ret = TRACE_Send();
  }
  else
  {
	TRACE_UnLock();
#if defined(UTIL_ADV_TRACE_OVERRUN)
	UTIL_ADV_TRACE_ENTER_CRITICAL_SECTION();
	if((ADV_TRACE_Ctx.OverRunStatus == TRACE_OVERRUN_NONE ) && (NULL != ADV_TRACE_Ctx.overrun_func))
	{
		UTIL_ADV_TRACE_DEBUG("UTIL_ADV_TRACE_Send:TRACE_OVERRUN_INDICATION");
		ADV_TRACE_Ctx.OverRunStatus = TRACE_OVERRUN_INDICATION;
	}
	UTIL_ADV_TRACE_EXIT_CRITICAL_SECTION();
#endif
    ret = UTIL_ADV_TRACE_MEM_FULL;
  }

  return ret;
}
#endif

UTIL_ADV_TRACE_Status_t UTIL_ADV_TRACE_Send(const uint8_t *pData, uint16_t Length)
{
  UTIL_ADV_TRACE_Status_t ret;  
  uint16_t writepos;
  uint32_t  idx;  

  TRACE_Lock();

  /* if allocation is ok, write data into the bufffer */
  if (TRACE_AllocateBufer(Length,&writepos) != -1)
  {

