TheThingsIndustries/generic-node-se/Software/target/stm32_adv_trace.c
#if defined(UTIL_ADV_TRACE_OVERRUN)
	UTIL_ADV_TRACE_ENTER_CRITICAL_SECTION();
    if(ADV_TRACE_Ctx.OverRunStatus == TRACE_OVERRUN_EXECUTED)
    {
      /* clear the over run */
	    ADV_TRACE_Ctx.OverRunStatus = TRACE_OVERRUN_NONE;
    }
    UTIL_ADV_TRACE_EXIT_CRITICAL_SECTION();
#endif
    
    /* initialize the Ptr for Read/Write */
    for (idx = 0u; idx < Length; idx++)
    {
      ADV_TRACE_Ctx.TraceBuffer[writepos] = pData[idx];
      writepos = (uint16_t)((writepos + 1u) % UTIL_ADV_TRACE_FIFO_SIZE);
    }
    TRACE_UnLock();
    
    ret = TRACE_Send();
  }
  else
  {
	TRACE_UnLock();
#if defined(UTIL_ADV_TRACE_OVERRUN)
	UTIL_ADV_TRACE_ENTER_CRITICAL_SECTION();
	if((ADV_TRACE_Ctx.OverRunStatus == TRACE_OVERRUN_NONE ) && (NULL != ADV_TRACE_Ctx.overrun_func))
	{
		UTIL_ADV_TRACE_DEBUG("UTIL_ADV_TRACE_Send:TRACE_OVERRUN_INDICATION");
		ADV_TRACE_Ctx.OverRunStatus = TRACE_OVERRUN_INDICATION;
	}
	UTIL_ADV_TRACE_EXIT_CRITICAL_SECTION();
#endif

    ret = UTIL_ADV_TRACE_MEM_FULL;
  }

  return ret;
}

#if defined(UTIL_ADV_TRACE_OVERRUN)
void UTIL_ADV_TRACE_RegisterOverRunFunction(cb_overrun *cb)
{
	ADV_TRACE_Ctx.overrun_func = *cb;
}
#endif

#if defined(UTIL_ADV_TRACE_CONDITIONNAL)
void UTIL_ADV_TRACE_RegisterTimeStampFunction(cb_timestamp *cb)
{
	ADV_TRACE_Ctx.timestamp_func = *cb;
}

void UTIL_ADV_TRACE_SetVerboseLevel(uint8_t Level)
{
	ADV_TRACE_Ctx.CurrentVerboseLevel = Level;
}

uint8_t UTIL_ADV_TRACE_GetVerboseLevel(void)
{
	return ADV_TRACE_Ctx.CurrentVerboseLevel;
}

void UTIL_ADV_TRACE_SetRegion(uint32_t Region)
{
	ADV_TRACE_Ctx.RegionMask|= Region;
}

uint32_t UTIL_ADV_TRACE_GetRegion(void)
{
	return ADV_TRACE_Ctx.RegionMask;
}

void UTIL_ADV_TRACE_ResetRegion(uint32_t Region)
{
	ADV_TRACE_Ctx.RegionMask&= ~Region;
}
#endif

__WEAK void UTIL_ADV_TRACE_PreSendHook (void)
{
}

__WEAK void UTIL_ADV_TRACE_PostSendHook (void)
{
}

/**
 * @}
 */

/** @addtogroup ADV_TRACE_private_function
 *  @{
 */

/**
  * @brief send the data of the trace to low layer
  * @retval Status based on @ref UTIL_ADV_TRACE_Status_t
  */
static UTIL_ADV_TRACE_Status_t TRACE_Send(void)
{
  UTIL_ADV_TRACE_Status_t ret = UTIL_ADV_TRACE_OK;  
  uint8_t *ptr = NULL;
  
  UTIL_ADV_TRACE_ENTER_CRITICAL_SECTION();  
  
  if(TRACE_IsLocked() == 0u)
  {
    TRACE_Lock();

#if defined(UTIL_ADV_TRACE_OVERRUN)
	if(ADV_TRACE_Ctx.OverRunStatus == TRACE_OVERRUN_INDICATION )
	{
		ADV_TRACE_Ctx.OverRunStatus = TRACE_OVERRUN_TRANSFERT;
	    UTIL_ADV_TRACE_EXIT_CRITICAL_SECTION();
	    UTIL_ADV_TRACE_PreSendHook();

	    ADV_TRACE_Ctx.overrun_func(&ptr, &ADV_TRACE_Ctx.TraceSentSize);
	    UTIL_ADV_TRACE_DEBUG("\n--TRACE_Send overrun(%d)--\n", ADV_TRACE_Ctx.TraceSentSize);
	    return UTIL_TraceDriver.Send(ptr, ADV_TRACE_Ctx.TraceSentSize);
	}
#endif

    if (ADV_TRACE_Ctx.TraceRdPtr != ADV_TRACE_Ctx.TraceWrPtr)
    {
#ifdef UTIL_ADV_TRACE_UNCHUNK_MODE
   	  if(TRACE_UNCHUNK_DETECTED == ADV_TRACE_Ctx.unchunk_status)
   	  {
        ADV_TRACE_Ctx.TraceSentSize = (uint16_t)(ADV_TRACE_Ctx.unchunk_enabled - ADV_TRACE_Ctx.TraceRdPtr);
        ADV_TRACE_Ctx.unchunk_status = TRACE_UNCHUNK_TRANSFER;
        ADV_TRACE_Ctx.unchunk_enabled = 0;
        
        UTIL_ADV_TRACE_DEBUG("\nTRACE_TxCpltCallback::unchunk start(%d,%d)\n",ADV_TRACE_Ctx.unchunk_enabled, ADV_TRACE_Ctx.TraceRdPtr);
        
        if (0u == ADV_TRACE_Ctx.TraceSentSize)
        {
          ADV_TRACE_Ctx.unchunk_status = TRACE_UNCHUNK_NONE;
          ADV_TRACE_Ctx.TraceRdPtr = 0;
        }
   	  }
      
   	  if(TRACE_UNCHUNK_NONE == ADV_TRACE_Ctx.unchunk_status)
   	  {
#endif
   	    if (ADV_TRACE_Ctx.TraceWrPtr > ADV_TRACE_Ctx.TraceRdPtr)
        {
   	    	ADV_TRACE_Ctx.TraceSentSize = ADV_TRACE_Ctx.TraceWrPtr - ADV_TRACE_Ctx.TraceRdPtr;
        }
        else  /* TraceRdPtr > TraceWrPtr */
        {
        	ADV_TRACE_Ctx.TraceSentSize = UTIL_ADV_TRACE_FIFO_SIZE - ADV_TRACE_Ctx.TraceRdPtr;

        }
#ifdef UTIL_ADV_TRACE_UNCHUNK_MODE
      }
#endif
      ptr = &ADV_TRACE_Ctx.TraceBuffer[ADV_TRACE_Ctx.TraceRdPtr];

      UTIL_ADV_TRACE_EXIT_CRITICAL_SECTION();
      UTIL_ADV_TRACE_PreSendHook(); 

      UTIL_ADV_TRACE_DEBUG("\n--TRACE_Send(%d-%d)--\n",ADV_TRACE_Ctx.TraceRdPtr, ADV_TRACE_Ctx.TraceSentSize);
      ret = UTIL_TraceDriver.Send(ptr, ADV_TRACE_Ctx.TraceSentSize);
    }
    else
    {
      TRACE_UnLock();
      UTIL_ADV_TRACE_EXIT_CRITICAL_SECTION();  
    }    
  }
  else
  {
    UTIL_ADV_TRACE_EXIT_CRITICAL_SECTION();  
  }
  
  return ret;
}

/**
  * @brief Tx callback called by the low layer level to inform a transfer complete
  * @param Ptr pointer not used only for HAL compatibility
  * @retval none
  */
static void TRACE_TxCpltCallback(void *Ptr)
{ 
  UTIL_ADV_TRACE_ENTER_CRITICAL_SECTION();
  
#if defined(UTIL_ADV_TRACE_OVERRUN)
  if(ADV_TRACE_Ctx.OverRunStatus == TRACE_OVERRUN_TRANSFERT )
  {
    ADV_TRACE_Ctx.OverRunStatus = TRACE_OVERRUN_EXECUTED;
    UTIL_ADV_TRACE_DEBUG("\n--TRACE_Send overrun complete--\n");
    ADV_TRACE_Ctx.TraceSentSize = 0u;
  }
#endif
  
#if defined(UTIL_ADV_TRACE_UNCHUNK_MODE)
  if(TRACE_UNCHUNK_TRANSFER == ADV_TRACE_Ctx.unchunk_status)
  {
	  ADV_TRACE_Ctx.unchunk_status = TRACE_UNCHUNK_NONE;
	  ADV_TRACE_Ctx.TraceRdPtr = 0;
	  UTIL_ADV_TRACE_DEBUG("\nTRACE_TxCpltCallback::unchunk complete\n");
  }
  else
  {
	  ADV_TRACE_Ctx.TraceRdPtr = (ADV_TRACE_Ctx.TraceRdPtr + ADV_TRACE_Ctx.TraceSentSize) % UTIL_ADV_TRACE_FIFO_SIZE;
  }
#else
  ADV_TRACE_Ctx.TraceRdPtr = (ADV_TRACE_Ctx.TraceRdPtr + ADV_TRACE_Ctx.TraceSentSize) % UTIL_ADV_TRACE_FIFO_SIZE;
#endif
  
#if defined(UTIL_ADV_TRACE_OVERRUN)
	if(ADV_TRACE_Ctx.OverRunStatus == TRACE_OVERRUN_INDICATION )
	{
		uint8_t *ptr = NULL;
    
		ADV_TRACE_Ctx.OverRunStatus = TRACE_OVERRUN_TRANSFERT;
		UTIL_ADV_TRACE_EXIT_CRITICAL_SECTION();
		ADV_TRACE_Ctx.overrun_func(&ptr, &ADV_TRACE_Ctx.TraceSentSize);
		UTIL_ADV_TRACE_DEBUG("\n--Driver_Send overrun(%d)--\n", ADV_TRACE_Ctx.TraceSentSize);
		UTIL_TraceDriver.Send(ptr, ADV_TRACE_Ctx.TraceSentSize);
    return;
	}
#endif
  
